# 4.6 Book 1. Instacart combining_exporting_ords_checked and_ords_prior_data

## This script contains the following points:

### 1. Import and check 'orders_checked.csv' and 'order_products_prior.csv' dataframes

### 2. Merge dataframes

### 3. Export merged 'orders_products_combined.pkl' dataframe as a pickle

In [1]:
# Import libraries

import pandas as pd
import numpy as np
import os

### 1. Import and check 'orders_checked.csv' and 'order_products_prior.csv' dataframes

In [2]:
path = r'C:\Users\howl6\OneDrive\Certificates\CareerFoundry\Coursework\Data_Immersion\Chapter 4\Instacart Basket Analysis'

In [3]:
# Import orders_checked.csv dataframe

df_ords = pd.read_csv(os.path.join(path,'02_Data','Prepared_Data', 'CSV_files', 'orders_checked.csv'), index_col=False)

In [4]:
# Import orders_products_prior.csv dataframe

df_ords_prior = pd.read_csv(os.path.join(path,'02_Data','Original_Data','4.6_order_products_prior','order_products__prior','order_products__prior.csv'), index_col=False)

In [8]:
# view top 5 rows of df_ords_prior

df_ords_prior.head()

   order_id  product_id  add_to_cart_order  reordered
0         2       33120                  1          1
1         2       28985                  2          1
2         2        9327                  3          0
3         2       45918                  4          1
4         2       30035                  5          0

In [6]:
df_ords_prior.shape

(32434489, 4)

In [5]:
# search for missing values (NaN)

df_ords_prior['order_id'].value_counts(dropna = False)

1564244    145
790903     137
61355      127
2970392    121
2069920    116
          ...
188978       1
1341758      1
1522006      1
1600231      1
2343880      1
Name: order_id, Length: 3214874, dtype: int64

In [12]:
df_nan = df_ords_prior[df_ords_prior['order_id'].isnull() == True]

In [13]:
df_nan

Empty DataFrame
Columns: [order_id, product_id, add_to_cart_order, reordered]
Index: []

### There are no missing values in df_ords_prior.

In [14]:
# create new dataframe df_dups to find duplicat rows

df_dups = df_ords_prior[df_ords_prior.duplicated()]

In [15]:
df_dups

Empty DataFrame
Columns: [order_id, product_id, add_to_cart_order, reordered]
Index: []

### There are no duplicates in df_ords_prior.

In [4]:
# view top 5 rows of df_ords

df_ords.head()

,Unnamed: 0,Unnamed: 0.1,order_id,user_id,order_number,orders_day_of_week,order_time_of_day,days_since_prior_order,first_time_order
0,0,0,2539329,1,1,2,8,NaN,True
1,1,1,2398795,1,2,3,7,15.0,False
2,2,2,473747,1,3,3,12,21.0,False
3,3,3,2254736,1,4,4,7,29.0,False
4,4,4,431534,1,5,4,15,28.0,False

In [10]:
# number of rows, columns in df_ords_prior

df_ords_prior.shape

(32434489, 4)

In [5]:
# number of rows, columns in df_ords

df_ords.shape

(3421083, 9)

In [12]:
# Two columns'Unnamed: 0' and 'Unnamed: 0.1' were dropped

df_ords = df_ords.drop (columns = ['Unnamed: 0'])

In [13]:
df_ords = df_ords.drop (columns = ['Unnamed: 0.1'])

In [14]:
# view top 5 rows

df_ords.head()

,order_id,user_id,order_number,orders_day_of_week,order_time_of_day,days_since_prior_order,first_time_order
0,2539329,1,1,2,8,NaN,True
1,2398795,1,2,3,7,15.0,False
2,473747,1,3,3,12,21.0,False
3,2254736,1,4,4,7,29.0,False
4,431534,1,5,4,15,28.0,False

In [15]:
# view number of rows, columns of df_ords

df_ords.shape

(3421083, 7)

### 2. Merge dataframes

In [17]:
# merge df_ords and df_ords_prior

df_merged_large = df_ords.merge(df_ords_prior, on = 'order_id', indicator = True)

In [18]:
# view top 5 rows of df_merged_large

df_merged_large.head()

,order_id,user_id,order_number,orders_day_of_week,order_time_of_day,days_since_prior_order,first_time_order,product_id,add_to_cart_order,reordered,_merge
0,2539329,1,1,2,8,NaN,True,196,1,0,both
1,2539329,1,1,2,8,NaN,True,14084,2,0,both
2,2539329,1,1,2,8,NaN,True,12427,3,0,both
3,2539329,1,1,2,8,NaN,True,26088,4,0,both
4,2539329,1,1,2,8,NaN,True,26405,5,0,both

In [29]:
# count of merged dataset

df_merged_large['_merge'].value_counts()

both          32434489
left_only            0
right_only           0
Name: _merge, dtype: int64

### 3. Export merged 'orders_products_combined.pkl' dataframe as a pickle

In [19]:
# export data to pkl

df_merged_large.to_pickle(os.path.join(path, '02_Data','Prepared_Data', 'orders_products_combined.pkl'))